In [17]:
import matplotlib.pyplot as plt
import numpy as np
import pandas as pd
import seaborn as sns
from env import username, password, hostname

In [18]:
# url = f'mysql+pymysql://{username}:{password}@{hostname}/curriculum_logs'
# query = """select * from logs join cohorts on logs.cohort_id = cohorts.id;"""
# df = pd.read_sql(query, url)
# df.drop("id", axis=1, inplace=True)
# df.to_csv("curriculum_logs.csv", index=False)
# df.head()

In [19]:
df = pd.read_csv("curriculum_logs.csv")
df.head(2)

,date,time,path,user_id,cohort_id,ip,name,slack,start_date,end_date,created_at,updated_at,deleted_at,program_id
0,2018-01-26,09:55:03,/,1,8.0,97.105.19.61,Hampton,#hampton,2015-09-22,2016-02-06,2016-06-14 19:52:26,2016-06-14 19:52:26,NaN,1
1,2018-01-26,09:56:02,java-ii,1,8.0,97.105.19.61,Hampton,#hampton,2015-09-22,2016-02-06,2016-06-14 19:52:26,2016-06-14 19:52:26,NaN,1

In [20]:
df["program_name"] = np.where(df["program_id"] == 3, "data science", "web dev")
df.head(2)

,date,time,path,user_id,cohort_id,ip,name,slack,start_date,end_date,created_at,updated_at,deleted_at,program_id,program_name
0,2018-01-26,09:55:03,/,1,8.0,97.105.19.61,Hampton,#hampton,2015-09-22,2016-02-06,2016-06-14 19:52:26,2016-06-14 19:52:26,NaN,1,web dev
1,2018-01-26,09:56:02,java-ii,1,8.0,97.105.19.61,Hampton,#hampton,2015-09-22,2016-02-06,2016-06-14 19:52:26,2016-06-14 19:52:26,NaN,1,web dev

In [21]:
df["date_time"] = pd.to_datetime(df['date'] + " " + df['time'])
df.head(2)

,date,time,path,user_id,cohort_id,ip,name,slack,start_date,end_date,created_at,updated_at,deleted_at,program_id,program_name,date_time
0,2018-01-26,09:55:03,/,1,8.0,97.105.19.61,Hampton,#hampton,2015-09-22,2016-02-06,2016-06-14 19:52:26,2016-06-14 19:52:26,NaN,1,web dev,2018-01-26 09:55:03
1,2018-01-26,09:56:02,java-ii,1,8.0,97.105.19.61,Hampton,#hampton,2015-09-22,2016-02-06,2016-06-14 19:52:26,2016-06-14 19:52:26,NaN,1,web dev,2018-01-26 09:56:02

In [22]:
df = df.set_index(df["date_time"]).drop(["date", "time", "date_time"], axis=1)
df.head(2)

,path,user_id,cohort_id,ip,name,slack,start_date,end_date,created_at,updated_at,deleted_at,program_id,program_name
date_time,,,,,,,,,,,,,
2018-01-26 09:55:03,/,1,8.0,97.105.19.61,Hampton,#hampton,2015-09-22,2016-02-06,2016-06-14 19:52:26,2016-06-14 19:52:26,NaN,1,web dev
2018-01-26 09:56:02,java-ii,1,8.0,97.105.19.61,Hampton,#hampton,2015-09-22,2016-02-06,2016-06-14 19:52:26,2016-06-14 19:52:26,NaN,1,web dev

1. Which lesson appears to attract the most traffic consistently across cohorts (per program)?

In [28]:
df.groupby(by=["program_name", "name"]).count()

                          path  user_id  cohort_id     ip  slack  start_date  \
program_name name
data science Bayes       26538    26538      26538  26538  26538       26538
             Curie       21581    21582      21582  21582  21582       21582
             Darden      32015    32015      32015  32015  32015       32015
             Easley      14715    14715      14715  14715  14715       14715
             Florence     8562     8562       8562   8562   8562        8562
web dev      Andromeda   25359    25359      25359  25359  25359       25359
             Apex        33568    33568      33568  33568  33568       33568
             Apollo          5        5          5      5      5           5
             Arches       8890     8890       8890   8890   8890        8890
             Badlands       93       93         93     93     93          93
             Bash        17713    17713      17713  17713  17713       17713
             Betelgeuse  29356    29356      29356  29356  29356       29356
             Ceres       40730    40730      40730  40730  40730       40730
             Deimos      32888    32888      32888  32888  32888       32888
             Denali          4        4          4      4      4           4
             Europa      28033    28033      28033  28033  28033       28033
             Everglades      1        1          1      1      1           1
             Fortuna     36902    36902      36902  36902  36902       36902
             Franklin       72       72         72     72     72          72
             Ganymede    33844    33844      33844  33844  33844       33844
             Glacier       598      598        598    598    598         598
             Hampton      1712     1712       1712   1712   1712        1712
             Hyperion    29855    29855      29855  29855  29855       29855
             Ike           253      253        253    253    253         253
             Joshua        302      302        302    302    302         302
             Jupiter     37109    37109      37109  37109  37109       37109
             Kalypso     23691    23691      23691  23691  23691       23691
             Kings        2845     2845       2845   2845   2845        2845
             Lassen       9587     9587       9587   9587   9587        9587
             Luna        16623    16623      16623  16623  16623       16623
             Mammoth       691      691        691    691    691         691
             Marco       16397    16397      16397  16397  16397       16397
             Neptune      7276     7276       7276   7276   7276        7276
             Niagara       755      755        755    755    755         755
             Oberon       1672     1672       1672   1672   1672        1672
             Olympic      4954     4954       4954   4954   4954        4954
             Pinnacles    2158     2158       2158   2158   2158        2158
             Quincy       1237     1237       1237   1237   1237        1237
             Sequoia      7444     7444       7444   7444   7444        7444
             Staff       84031    84031      84031  84031  84031       84031
             Teddy       30926    30926      30926  30926  30926       30926
             Ulysses     28534    28534      28534  28534  28534       28534
             Voyageurs   35636    35636      35636  35636  35636       35636
             Wrangell    25586    25586      25586  25586  25586       25586
             Xanadu      27749    27749      27749  27749  27749       27749
             Yosemite    20743    20743      20743  20743  20743       20743
             Zion        38096    38096      38096  38096  38096       38096

                         end_date  created_at  updated_at  deleted_at  \
program_name name
data science Bayes          26538       26538       26538           0
             Curie          21582       21582       21582           0
             Darden         32015       32015       32015           0
             Easley         14715       14715       14715           0
             Florence        8562        8562        8562           0
web dev      Andromeda      25359       25359       25359           0
             Apex           33568       33568       33568           0
             Apollo             5           5           5           0
             Arches          8890        8890        8890           0
             Badlands          93          93          93           0
             Bash           17713       17713       17713           0
             Betelgeuse     29356       29356       29356           0
             Ceres          40730       40730       40730           0
             Deimos         32888       32888       32888           0
             Denali             4           4           4           0
             Europa         28033       28033       28033           0
             Everglades         1           1           1           0
             Fortuna        36902       36902       36902           0
             Franklin          72          72          72           0
             Ganymede       33844       33844       33844           0
             Glacier          598         598         598           0
             Hampton         1712        1712        1712           0
             Hyperion       29855       29855       29855           0
             Ike              253         253         253           0
             Joshua           302         302         302           0
             Jupiter        37109       37109       37109           0
             Kalypso        23691       23691       23691           0
             Kings           2845        2845        2845           0
             Lassen          9587        9587        9587           0
             Luna           16623       16623       16623           0
             Mammoth          691         691         691           0
             Marco          16397       16397       16397           0
             Neptune         7276        7276        7276           0
             Niagara          755         755         755           0
             Oberon          1672        1672        1672           0
             Olympic         4954        4954        4954           0
             Pinnacles       2158        2158        2158           0
             Quincy          1237        1237        1237           0
             Sequoia         7444        7444        7444           0
             Staff          84031       84031       84031           0
             Teddy          30926       30926       30926           0
             Ulysses        28534       28534       28534           0
             Voyageurs      35636       35636       35636           0
             Wrangell       25586       25586       25586           0
             Xanadu         27749       27749       27749           0
             Yosemite       20743       20743       20743           0
             Zion           38096       38096       38096           0

                         program_id
program_name name
data science Bayes            26538
             Curie            21582
             Darden           32015
             Easley           14715
             Florence          8562
web dev      Andromeda        25359
             Apex             33568
             Apollo               5
             Arches            8890
             Badlands            93
             Bash             17713
             Betelgeuse       29356
             Ceres            40730
             Deimos           32888
             Denali               4
             Europa           28033
             Everglades           1
             Fortuna          36902
             Franklin            72
             Ganymede         33844
             Glacier            598
             Hampton           1712
             Hyperion         29855
             Ike                253
             Joshua             302
             Jupiter          37109
             Kalypso          23691
             Kings             2845
             Lassen            9587
             Luna             16623
             Mammoth            691
             Marco            16397
             Neptune           7276
             Niagara            755
             Oberon            1672
             Olympic           4954
             Pinnacles         2158
             Quincy            1237
             Sequoia           7444
             Staff            84031
             Teddy            30926
             Ulysses          28534
             Voyageurs        35636
             Wrangell         25586
             Xanadu           27749
             Yosemite         20743
             Zion             38096

2. Is there a cohort that referred to a lesson significantly more than other cohorts seemed to gloss over?
- These are the top 10 cohorts who accessed the curriculum the most
### DONE

In [ ]:
df[["name", "path"]][df["name"] != "Staff"].groupby(by=["name"], sort=False).count().nlargest(n=10, columns="path", keep="first")

3. Are there students who, when active, hardly access the curriculum? If so, what information do you have about these students?
- These students were active students and not staff. These are the 10 students whom accessed the curriculum the fewest
### DONE

In [ ]:
was_student = (df.index < df["end_date"]) & (df.index > df["start_date"])
not_staff = (df["name"] != "Staff")

df[["user_id", "path"]][was_student & not_staff].groupby(by=["user_id"], sort=False).count().nsmallest(n=10, columns="path", keep="first")

4. Is there any suspicious activity, such as users/machines/etc accessing the curriculum who shouldnt be? Does it appear that any web-scraping is happening? Are there any suspicious IP addresses?

5. At some point in 2019, the ability for students and alumni to access both curriculums (web dev to ds, ds to web dev) should have been shut off. Do you see any evidence of that happening? Did it happen before?

6. What topics are grads continuing to reference after graduation and into their jobs (for each program)?
- These are the topics by program that got referenced after a student graduated.
### DONE

In [ ]:
df["path"][(df.index > df["end_date"]) & (df["program_name"] == "web dev") & (df["name"] != "Staff")]

In [ ]:
df["path"][(df.index > df["end_date"]) & (df["program_name"] == "data science") & (df["name"] != "Staff")]

7. Which lessons are least accessed?
- These are the top 50 least accessed topics, but this can be adjusted based on needs
### DONE

In [ ]:
df1["path"].value_counts(ascending=True).nsmallest(n=50, keep="first").to_dict()